benchmark/report/rps/full/20260804_171435/raw/037_range_1mb_c1_r1.txt
Running 20s test @ http://127.0.0.1:32782/api/files/2/stream
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    85.49ms   14.49ms 163.19ms   78.21%
    Req/Sec    11.70      4.05    20.00     79.49%
  Latency Distribution
     50%   82.58ms
     75%   91.27ms
     90%  103.93ms
     99%  133.01ms
  234 requests in 20.07s, 350.54KB read
Requests/sec:     11.66
Transfer/sec:     17.46KB
HPS_WRK_REQUESTS 234
HPS_WRK_STATUS_ERRORS 0
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 234
HPS_STATUS_2XX 234
HPS_STATUS_NON_2XX 0
HPS_STATUS_UNEXPECTED 0
HPS_STATUS_CODES 206=234